***Feature Engineering is a process of extracting useful features from raw data using Maths, Statistics and Domain Knowledge.***

# Outlier Removal Using Percentile

In [1]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv('heights.csv')
df.head()
df.shape

(14, 2)

In [3]:
max_threshhold = df['height'].quantile(0.95)
max_threshhold

9.689999999999998

In [5]:
# person whose height is above 95% of all the other heights.
df[df['height'] > max_threshhold]

    name  height
9  imran    14.5

In [6]:
min_threshhold = df['height'].quantile(0.05)
min_threshhold

3.6050000000000004

In [7]:
# person whose height is below 5% of all the other heights.
df[df['height'] < min_threshhold]

      name  height
12  yoseph     1.2

In [12]:
# remove the outliers
df1 = df[(df['height'] > min_threshhold) & (df['height'] < max_threshhold)]
df1.head()
df1.shape

(12, 2)

***Bangalore House Price***

In [13]:
data = pd.read_csv('bhp.csv')
data.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [16]:
data.shape

(13200, 7)

In [15]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [22]:
min, max = data.price_per_sqft.quantile([0.001,0.999])
min, max

(1366.184, 50959.36200000098)

In [23]:
data1 = data[(data['price_per_sqft']>min) & (data['price_per_sqft']<max)]
data1.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [24]:
data1.shape

(13172, 7)